#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/90af7e8f-6f05-4098-9545-091f8b76fe50/terraform-bin plan -out=tfplan -no-color
module.ecr_app.data.aws_partition.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_partition.current: Reading...
module.ecr_app.data.aws_caller_identity.current: Reading...
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_region.current: Reading...
module.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
module.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05018c9f2f5eafe4b]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z063915822N0BC5ZKYHSW]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
aws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]
module.ecr_pipeline.data.aws_partition.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
aws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]
module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]
aws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]
aws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=1021686302]
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1109128757]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2104895008]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d97142a73d67d383]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a9210d6e819860d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-032d14adb1303873e]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07986bda8849d0ea6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0da33de95c6b30c0e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03321fcddf6a74d6a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0119e203c5ba1a0e1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0502dd160b8708725]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-052ff9e03f698ca76]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cec7d9e9cd165d57]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cbf63d01a13e0462]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03666b60bcf3f78c8]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-01c41d6fc69feb22d]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04be5e4a51b23c194]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-059af2db14f4039a5]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5f4a3925c0ced23]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1546531447]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-453735656]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eab9fa3eeddf9c1b]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-016b50f675e1c6265]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cec7d9e9cd165d571080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06100b0df70c7348d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a08e39f05edda624]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c69eb1f086c8bc1b]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-08d766ec44e726fbb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bbb0b76584dd1246]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-001aad6eb2f84eccb]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-032d14adb1303873e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04a9210d6e819860d1080289494]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.alb.data.aws_partition.current[0]: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251114191934237600000001/86f036e9c7054a92]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0109020a2ce187eed]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116590584470000000a]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-03178a9b6cf6d516c]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0438f20217fc0f62b]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0c034a063156f97cd]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:loadbalancer/app/aidoctors-alb/c1df99f5c4d6fbfe]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-019097a522275337e]
module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]
aws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:listener/app/aidoctors-alb/c1df99f5c4d6fbfe/83e3d8fabb2dd974]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-34QQRRU2QS2LU342HBYZTZ56C4]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-a1871dd0-2a3d-4afb-a054-31bc567abf85-qYjcf5]
aws_route53_record.root: Refreshing state... [id=Z063915822N0BC5ZKYHSW_aidoctors.com_A]
aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
      ~ desired_count                      = 1 -> 3
        id                                 = "arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service"
        name                               = "aidoctors-app-service"
        tags                               = {
            "Name" = "aidoctors-app-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:4" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - mountPoints      = []
                    name             = "aidoctors-app-container"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ]
        )
      ~ cpu                      = "256" -> "4096" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "aidoctors-app" -> (known after apply)
      ~ memory                   = "512" -> "8192" # forces replacement
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "Name" = "aidoctors-app-task-definition"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ecr_app.data.aws_partition.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.ecr_app.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Amodule.ecr_pipeline.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05018c9f2f5eafe4b]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z063915822N0BC5ZKYHSW]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Aaws_cloudwatch_log_group.ecs_app: Refreshing state... [id=/ecs/aidoctors-app]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=033236469452]%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_cloudwatch_log_group.ecs_datapipeline: Refreshing state... [id=/ecs/aidoctors-datapipeline]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=2322280200]%0Amodule.ecr_pipeline.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecr_pipeline.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-pipeline]%0Amodule.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:cluster/aidoctors-cluster]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.ecr_app.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_app.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]%0Aaws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]%0Aaws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]%0Aaws_ecs_task_definition.pipeline: Refreshing state... [id=aidoctors-pipeline]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=1021686302]%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1109128757]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2104895008]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d97142a73d67d383]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a9210d6e819860d]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-032d14adb1303873e]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07986bda8849d0ea6]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0da33de95c6b30c0e]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-03321fcddf6a74d6a]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0119e203c5ba1a0e1]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0502dd160b8708725]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-052ff9e03f698ca76]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cec7d9e9cd165d57]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0cbf63d01a13e0462]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03666b60bcf3f78c8]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-01c41d6fc69feb22d]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-04be5e4a51b23c194]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-059af2db14f4039a5]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d5f4a3925c0ced23]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1546531447]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-453735656]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eab9fa3eeddf9c1b]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-016b50f675e1c6265]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cec7d9e9cd165d571080289494]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06100b0df70c7348d]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a08e39f05edda624]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c69eb1f086c8bc1b]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-08d766ec44e726fbb]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bbb0b76584dd1246]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-001aad6eb2f84eccb]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-032d14adb1303873e1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-04a9210d6e819860d1080289494]%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.alb.data.aws_partition.current[0]: Reading...%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:targetgroup/aid20251114191934237600000001/86f036e9c7054a92]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0109020a2ce187eed]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-2025103116590584470000000a]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-03178a9b6cf6d516c]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-0438f20217fc0f62b]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0c034a063156f97cd]%0Amodule.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:loadbalancer/app/aidoctors-alb/c1df99f5c4d6fbfe]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-019097a522275337e]%0Amodule.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logfiles]%0Aaws_ecs_service.pipeline: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-pipeline-service]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:033236469452:listener/app/aidoctors-alb/c1df99f5c4d6fbfe/83e3d8fabb2dd974]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-34QQRRU2QS2LU342HBYZTZ56C4]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:033236469452:secret:rds!db-a1871dd0-2a3d-4afb-a054-31bc567abf85-qYjcf5]%0Aaws_route53_record.root: Refreshing state... [id=Z063915822N0BC5ZKYHSW_aidoctors.com_A]%0Aaws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_service.app will be updated in-place%0A  ~ resource "aws_ecs_service" "app" {%0A      ~ desired_count                      = 1 -> 3%0A        id                                 = "arn:aws:ecs:us-east-1:033236469452:service/aidoctors-cluster/aidoctors-app-service"%0A        name                               = "aidoctors-app-service"%0A        tags                               = {%0A            "Name" = "aidoctors-app-service"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:4" -> (known after apply)%0A        # (17 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app:4" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:033236469452:task-definition/aidoctors-app" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [%0A              ~ {%0A                  - environment      = []%0A                  - mountPoints      = []%0A                    name             = "aidoctors-app-container"%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                    # (4 unchanged attributes hidden)%0A                },%0A            ]%0A        )%0A      ~ cpu                      = "256" -> "4096" # forces replacement%0A      ~ enable_fault_injection   = false -> (known after apply)%0A      ~ id                       = "aidoctors-app" -> (known after apply)%0A      ~ memory                   = "512" -> "8192" # forces replacement%0A      ~ revision                 = 4 -> (known after apply)%0A        tags                     = {%0A            "Name" = "aidoctors-app-task-definition"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @rayceramsay, Action: `pull_request`, Workflow: `Terraform PR Check`*